<?php

return [
    'order' => [
        'status' => [
            '1' => 'البحث عن سائق',
            '2' => 'التحضير',
            '3' => 'استكمال الطلب',
            '4' => 'انتظار الزبون للقبول',
            '5' => 'البحث عن سائق توصيل',
            '6' => 'في الطريق لاستلام وصفة الزبون',
            '7' => 'في الطريق لاستلام منتج الزبون',
            '8' => 'تم الاكتمال والدفع',
            '9' => 'تم الإلغاء من قبل الصيدلي',
            '10' => 'تم الإلغاء من قبل الزبون',
            '11' => 'تم الإلغاء من قبل الإدارة',
            '12' => 'حالة طارئة من قبل السائق',
        ]
    ],
];
