<?php

return [
    'unauthorized' => 'هذا الإجراء غير مصرح به.',
    'model_not_found' => ':model غير موجودة!',

    'discount_code' => [
        'invalid' => 'كود الحسم غير صحيح',
        'code_active' => 'كود الحسم فعل لديك بالفعل',
        'not_enough_points' => 'لا تملك كما كافيا من النقاط',

    ],

    'order_note' => [
        'fixed' => 'لا يمكن التعديل او الحذف على الملاحظات الثابتة'
    ],

    'order' => [
        'area' => [
            'exist' => 'المنطقة ليست موجودة',
            'active' => 'المنطقة غير فعالة',
            'exist_or_active' => 'المنطقة غير فعالة أو ليست موجودة',
        ],
        'driver' => [
            'accept' => 'لا يمكن قبول الطلب ',
            'reject' => 'لا يمكن رفض الطلب ',
            'belong' => 'هذا الطلب غير مخصص للهذا السائق',
            'emergency' => 'لا يمكن وضع الطلب بحالة طارئة  ',
            'rout_product' => 'لا يمكن وضع الطلب بحالة التقاط المنتجات',
            'complete' => 'لا يمكن وضع الطلب بحالة  مكتمل',
            'pickup_product' => 'لا يمكن وضع الطلب بحالة  نقل إلى جلب المنتجات',
            'take' => 'لا تملك مال او غير متصل',
            'status' => 'الطلب ليس في حالة البحث عن السائقين',
        ],
        'client' => [
            'selected_store' => 'المتجر المختار مغلق.'
        ],
        'time' => 'لقد تجاوزت الوقت المسموح به لقبول الطلب',
        'public_service' => 'تم تعطيل إنشاء الطلبات حاليًا. يرجى الاتصال بخدمة العملاء للمساعدة.',
    ],
    'payments' => [
        'confirm' => [
            'not_auth' => 'هذه الدفعة لا تنتمي لك',
        ]
    ],

    'product' => [
        'store' => [
            'not_found' => 'المنتج غير موجود في هذا المتجر'
        ],
        'unit' => 'product not sold by unit'
    ],

    'client' => [
        'city' => 'انت لا تنتمي لأي مدينة'
    ],

    'auth' => [
        'banned' => 'حسابك محظور'
    ],
];
